# Brewfile — managed via `brew bundle`
# Install:  brew bundle --file=./Brewfile

# --- Provisioning ---
brew "ansible"

# --- Shell & terminal ---
brew "zsh"
brew "tmux"
brew "tmuxinator"

# --- CLI utilities ---
brew "coreutils"
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "jq"
brew "yq"
brew "htop"
brew "watch"
brew "stow"
brew "httpie"
brew "hey"
brew "direnv"
brew "zoxide"
brew "btop"
brew "fx"
brew "jless"
brew "shellcheck"
brew "shfmt"
brew "mas"

# --- Languages & version management ---
brew "asdf"
brew "rustup"
brew "lua"
brew "luarocks"

# --- Neovim build deps ---
brew "cmake"
brew "ninja"
brew "gettext"

# --- Databases ---
brew "pgcli"
brew "pgweb"

# --- Go dev ---
brew "delve"
brew "grpcurl"

# --- Containers & Kubernetes ---
brew "dive"
brew "kubectl"
brew "kind"
brew "helm"
brew "kustomize"
brew "stern"
brew "k9s"
brew "kubectx"

# --- Infrastructure ---
brew "opentofu"

# --- Casks ---
cask "orbstack"
cask "raycast"
cask "zed"

# --- Fonts ---
cask "font-cascadia-code"
cask "font-jetbrains-mono"
